#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_ЗаполнитьГрафик(Команда)
	ВыполнитьОбработку();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Обработка завершена!";
	Сообщение.Сообщить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбработку()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВКМ_ЗаполнитьГрафик(ВКМ_Период.ДатаНачала, ВКМ_Период.ДатаОкончания, ВКМ_Выходные);
КонецПроцедуры

#КонецОбласти