#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВКМ_Заполнить(Команда)
	ВКМ_ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ЗаполнитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник КАК Сотрудник,
				   |	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток) КАК СуммаОстаток,
				   |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_ВидРасчета КАК ВидРасчета
				   |ИЗ
				   |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
				   |СГРУППИРОВАТЬ ПО
				   |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник,
				   |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_ВидРасчета";

	Период = Новый Граница(Объект.Дата, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Период", Период);
	Результат = Запрос.Выполнить().Выбрать();

	Объект.ВКМ_Выплаты.Очистить();

	Пока Результат.Следующий() Цикл

		Строка = Объект.ВКМ_Выплаты.Добавить();
		Строка.ВКМ_Сотрудник = Результат.Сотрудник;
		Строка.ВКМ_ВидРасчета = Результат.ВидРасчета;
		Строка.ВКМ_Сумма = Результат.СуммаОстаток;

	КонецЦикла;

КонецПроцедуры
#КонецОбласти