#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Адрес = Параметры.АдресВХранилище;
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл  
		
		Точка = ВКМ_ДиаграммаГанта.УстановитьТочку(Строка.ВКМ_Сотрудник);
		Серия = ВКМ_ДиаграммаГанта.УстановитьСерию("Отпуск");
		
		Значение = ВКМ_ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ВКМ_ДатаНачала;
		Интервал.Конец = Строка.ВКМ_ДатаОкончания;	
		
		СтрокаТаб = Объект.ВКМ_ОтпускаСотрудников.Добавить();
		СтрокаТаб.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник;
		СтрокаТаб.ВКМ_ДатаНачала = Строка.ВКМ_ДатаНачала;
		СтрокаТаб.ВКМ_ДатаОкончания = Строка.ВКМ_ДатаОкончания;
	КонецЦикла; 

КонецПроцедуры
#КонецОбласти

